PART/Doc/Service Description/Eventbroker_Notification.Notify.soap.xml

POST /Services/Notification.asmx HTTP/1.1
Host: localhost
Content-Type: application/soap+xml; charset=utf-8
Content-Length: length

<?xml version="1.0" encoding="utf-8"?>
<soap12:Envelope xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:soap12="http://www.w3.org/2003/05/soap-envelope">
  <soap12:Body>
    <Notify xmlns="http://dk.itst">
      <notification>
        <EventInfoStructure>
          <EventIdentifier>string</EventIdentifier>
          <EventProducerReference>string</EventProducerReference>
          <EventRegistrationDateTime>dateTime</EventRegistrationDateTime>
          <EventObjectStructure>
            <ObjectTypeReference>string</ObjectTypeReference>
            <EventObjectReference>string</EventObjectReference>
            <actionSchemeReference>string</actionSchemeReference>
            <EventObjectActionCode>string</EventObjectActionCode>
          </EventObjectStructure>
          <ExtensionStructure>
            <ID>guid</ID>
            <Item xsi:nil="true" />
          </ExtensionStructure>
        </EventInfoStructure>
        <EventTopic>string</EventTopic>
        <EventSubscriptionReference>string</EventSubscriptionReference>
        <ExtensionStructure>
          <ID>guid</ID>
          <Item>
            <anyType />
            <anyType />
          </Item>
        </ExtensionStructure>
        <EventDetailStructure />
      </notification>
    </Notify>
  </soap12:Body>
</soap12:Envelope>




HTTP/1.1 200 OK
Content-Type: application/soap+xml; charset=utf-8
Content-Length: length

<?xml version="1.0" encoding="utf-8"?>
<soap12:Envelope xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:soap12="http://www.w3.org/2003/05/soap-envelope">
  <soap12:Body>
    <NotifyResponse xmlns="http://dk.itst" />
  </soap12:Body>
</soap12:Envelope>
